#include <stdio.h>
int main(){
	/**
	 * 1.数组指针：int (*p)[n] ;int(p)[n]【*可省略】本质上是指针【具有指针类型的数组】，它是存放在与二维以及多维数组中的行指针
	 *		【二维数组按照行存储优先】
	 **/	
	
	/**
	 * 二维数组 只有在赋值之之后或者做形参的时候才可以省略 一维的大小
	 * 		数组名 为指向第一个元素的首地址，也是第一行的指针
	 **/
	int b[2][3] = {1,2,3,4,5,6};   
	int (*p1)[3];//  int(*p) [3];数组指针必须带括号------一个指针，它指向一个有3个int元素的数组
	//int (p1)[3]
	
	p1 = b; //p1指向二维数组 第一行------*p存的是指向首行地址【类比二维指针】，*（*p+i)表示偏移i个单位，**p表示取首行元素
	printf("第一行第i个元素p1的值为=%d\n",(*p1)[5]);
	
	for(int i= 0;i<2;i++){
		for(int j = 0;j<3;j++){
			printf("第%d行%d列的元素a[%d][%d] = %d\n",i,j,i,j,*(*p1+i*3+j));
			printf("第%d行%d列的元素a[%d][%d] = %d\n",i,j,i,j,p1[i][j]);
		}
	}
	
	/**
	 * 2.指针数组：int *p[n]; 本质上是数组，存放的是n个指针，每个指针存放的是各自指向的地址
	 **/
	char *a0 = "dfg";
	char *a1 = "niaho";
	char *a2 = "kjdf";
	printf("a0字符串为：%s\n",a0);//输出 指针字符串
	int *p[4] = {a0,a1,a2,NULL};//指针数组的初始化-------整体全部赋值
	int *p3[4] = {a0,a1,a2};//指针数组的初始化---------局部赋值
	printf("%p %p\n",p,p3);//%p 为打印变量地址p为（pointer指针的缩写）
	for(int i=0;i<4;i++){
//		printf("%c %c\n",*p[i],*p3[i]);
//		printf("%d %d\n",p[i],p3[i]);
		printf("%s %s\n",p[i],p3[i]);
	}
	int **a[4];//二维指针数组：存放的是4个二维指针地址
	
}
