#include <stdio.h>
void change(int x){ //局部变量
	printf("%d\n",x); //i的值赋值给x
	x = 10;
	printf("%d\n",x); //
}

void change2(int *y){ //形参存的实参地址----p指针变量存放的实参地址。

	*y = 20;//*P 解引用*p是实参的值
}
int main(){
	
	/**
	 * 1. 函数调用的值传递 ----------把形参的值赋给实参
	 **/
	int i = 2; //局部变量
	printf("i改变之前i=%d\n",i);
	change(i); //把形参的值赋给实参 --- 把i的值赋值给x；
	printf("i改变之后i=%d\n",i);
	
	
	
	/**
	 * 2. 传递的参数改为，传递地址-----------用到指针
	 * 		例如在数组中 数组名的传递就是传递地址---数组名为首地址
	 **/
	int j = 3;
	change2(&j); //实参传递给形参的是：实参的地址-----------此时函数调用改变就直接改变的是实参的值
	printf("j改变之后的值j=%d",j);
	return 0;
}
