#include <stdio.h>
int main(){
	int a[3] = {1,4,6};
	int *p;
	int j;
	p = a; //把数组的起始地址赋值给指针p
	int m = *p+1;
	/**
	 * 1. i++ 先赋值再自增1 
	 * 因为*与++优先级相同，所以从右向左计算；
	 * 		m = (*P)+1 = 2
	 * 		*p的值即a[0]的值，因为p中存放的地址指向a[0] 先赋值j=*p= a[0] =1
	 * 		再自增1 此时从右到左，先对p增1，即对p+1个基类型大小
	 * 		此时p指向a[1] ----*p = a[1] = 4;
	 * 		
	 * 		所以最后a[0] = *p = 4
	 **/
	j = *p++;  
	printf("a[0]=%d,j=%d,*p=%d,m=%d\n",a[0],j,*p,m); //1,1,4 ,2
	
	/**
	 * 2.有()时，()优先级最高
	 * 		先赋值j = *p = a[1] = 4;
	 * 		*p自增1 *p = 5;
	 *  	a[1]因为*p指向a[1]所以 a[1] = *p = 5 ------------********************
	 * 
	 **/
	j = (*p)++;
	printf("a[1]=%d,j=%d,*p=%d,m=%d\n",a[1],j,*p,m); //1,4,5 ,2
	
	
	/**
	 * 3. 此时p的地址指向a[1]    p[0] = a[1] = 5
	 * 		j = p[0] = 5
	 * 		a[0] 不变 a[0] = 1;
	 * 		p[0]自增1 *p = p[0]= 5+1 = 6;
	 * 		m 不变 m =2;
	 * 		*P指向a[1] 所以a[1] = *p = 6
	 **/
	j = p[0]++; 
	printf("a[0]=%d,a[1]=%d,j=%d,*p=%d,m=%d\n",a[0],a[1],j,*p,m); //1,6,5 ,6,2
	
	
	
	/**
	 * 4. 此时p的地址指向a[1]    p[1] = a[2] = 6
	 * 		j = p[1] = 6
	 * 		a[0] 不变 a[0] = 1;
	 * 		p[1]自增1 a[2] = p[1] = 6+1=7
	 * 		*p = p[0]= 6;
	 * 		m 不变 m =2;
	 * 		*P指向a[1] 所以a[1] = *p = 6
	 * 		
	 **/
	j = p[1]++; 
	printf("a[0]=%d,a[1]=%d,a[2]=%d,j=%d,*p=%d,m=%d",a[0],a[1],a[2],j,*p,m); //1,6,7,6 ,6,2	
	
}
